<?php
$errors = [
	'DB' => [
		[
			'code' => 1,
			'message' => "Поле таблиці не може бути порожнім",
			'desc' => "
					З’являється у випадку якщо ми працюючи з таблицею в базі даних пробуємо
					оперувати якимось полем (створювати, оновлювати чи переглядати дані що в ньому
					знаходяться) і замість коректної назви поля передаємо пустоту.
				",
		],
		[
			'code' => 2,
			'message' => "Ім’я таблиці не може бути порожнім",
			'desc' => "
					З’являється у випадку, якщо ми створюємо, працюємо чи іншим чином взаємодіємо з таблицею
					в базі даних. І замість коректної назви таблиці надаємо пустоту.
				",
		],
		[
			'code' => 3,
			'message' => "Оновлюваний параметр пошуку, повинен бути заданий непустим рядком, 
						цілим числом, чи масивом з полем та значенням",
			'desc' => "
					З’являється у випадку, якщо ми створюємо, оновлюємо якісь дані в певній таблиці 
					і або передаємо пусте значення або не дотримуємось вказаних типів. Дозволеними
					типами для цього випадку є число, масив формату ['поле таблиці' => 'значення в цьому полі'],
					 рядок який містить в собі число, тобто \"1\" або \"1вавіаів\". Взагалі рядки, які 
					 передаються в методи та функції що викликають цю помилку - приводяться до int
					 значень, згідно документації PHP.
				",
		],
		[
			'code' => 4,
			'message' => "Даний запис відсутній",
			'desc' => "З’являється у випадку, відсутності в таблиці запису, 
						який ми шукаємо, або з яким працюємо.",
		],
		[
			'code' => 5,
			'message' => "Дані для оновлення є обов’язковим параметром",
			'desc' => "З’являється у випадку, відсутності обов’язкового аргументу для методу. Найчастіше
						може виникати в методах на оновлення даних.",
		],
		[
			'code' => 6,
			'message' => "Дане поле не існує",
			'desc' => "З’являється у випадку відсутності в таблиці поля, з яким ми намагаємось взаємодіяти.",
		],
		[
			'code' => 7,
			'message' => "Метод для отримання даних не отримав обов‘язкових аргументів",
			'desc' => "З’являється у випадку відсутності обов’язкових аргументів для методу. Зазвичай виникає в
			методах отримання даних з бази.",
		],
		[
			'code' => 8,
			'message' => "Вказаного типу повернення даних, немає в переліку дозволених типів",
			'desc' => "З’являється у випадку некоректного вказання типу повертаємих даних.",
		],
		[
			'code' => 9,
			'message' => "Очікується інший тип вхідних даних.",
			'desc' => "Передані елементи масиву ідентифікаторів повинні бути
			 такими що приводяться до типу int або типу int.",
		],
		[
			'code' => 10,
			'message' => "Використовується недоступний зараз, тип повернення даних.",
			'desc' => "Це свідчить про те, що ви намагаєтесь отримати дані того типу 
			який недоступний на даний момент, але є в переліку дозволених типів.",
		]
	]
];